[{"recipename":"Chocolate Chip Cookies","id":4,"category":"Baking","source":"NY Times","image":"cookie.png","intro":"A gluten-free version that works well..","ingredient":[{"value":"8","unit":"tablespoons","name":"butter, 112 g, room temp."},{"value":"2 1/4","unit":"cups","name":"gluten free flour"},{"value":"1/2","unit":"teaspoon","name":"salt"},{"value":"1","unit":"teaspoon","name":"xanthan gum"},{"value":"1","unit":"teaspoon","name":"baking soda"},{"value":"3/4","unit":"cup","name":"light brown sugar, packed"},{"value":"3/4","unit":"cup","name":"sugar"},{"value":"2","unit":"","name":"eggs, beaten"},{"value":"12","unit":"oz","name":"chocolate chips"},{"value":"","unit":"","name":"chopped raisins, almonds, walnuts"}],"directions":["Preheat your oven to 350°F. Line rimmed baking sheets with unbleached parchment paper and set them aside.","In a large bowl, place the flour, xanthan gum, salt, baking soda and granulated sugar, and whisk\n            to combine well. Add the brown sugar, and whisk again to combine, working out any lumps in the\n            brown sugar. Create a well in the center of the dry ingredients, and add the butter, eggs, and\n            vanilla, and mix until well-combined. You can use a stand mixer fitted with the paddle attachment\n            to make quick work of it. Add 12 ounces of chocolate chips and mix until evenly distributed\n            throughout the cookie dough. The cookie dough will be thick but not stiff. Add more chocolate chips\n            if you like, and mix thoroughly.","Divide the cookie dough into 21 portions (or 24 if you’ve used all 16 ounces of chips), and roll each tightly into a ball about 1 1/2 inches in diameter (and about 50 grams each). Press each of the balls of dough into a disk about 1/2-inch thick and place about 2 inches apart on the prepared baking sheets. As you’re rolling the dough, add a few more chocolate chips to each ball, if desired, and roll them into the dough. To ensure the thickest cookies, place the baking sheet in the freezer for 5 minutes, or until the dough is cold.","Remove the chilled dough from the freezer and place the baking sheets, one at a time, in the center of the preheated oven. Bake until the cookies are golden brown around the edges, light golden brown all over and set in the center (about 12 minutes). Remove from the oven and allow the cookies to cool on the baking sheet for about 5 minutes or until firm before transferring to a wire rack to cool completely."]},{"recipename":"Butter Biscuits","id":5,"category":"Baking","source":"NY Times","image":"biscuit.png","ingredient":[{"value":"8","unit":"tablespoons","name":"cold unsalted butter (1 stick)"},{"value":"3","unit":"cups","name":"flour, plus more for the work surface"},{"value":"1","unit":"teaspoon","name":"salt"},{"value":"1","unit":"teaspoon","name":"baking powder"},{"value":"1/4","unit":"teaspoon","name":"baking soda"},{"value":"1","unit":"cup","name":"regular or low-fat buttermilk (plus 1 T)"},{"value":"2","unit":"tablespoons","name":"salted or unsalted butter, melted, for optional brushing"}],"directions":["Cut the cold butter into 1/8-inch-thick slices; refrigerate until you're ready to make the dough.","Whisk together the flour, salt, baking powder and baking soda in a mixing bowl, and\nrefrigerate that as well.","Position a rack in the upper third of the oven; preheat to 425 degrees. Lightly grease a\nrimmed baking sheet, or line it with parchment paper or a silicone liner.","Add the cold butter pieces to the chilled dry ingredients, tossing them until they are\nevenly coated. Press the butter pieces between your thumbs and forefingers into small\nflat pieces, or “leaves.” (Some pieces as big as a quarter are okay.) Add the buttermilk,\nas needed, and mix gently until just combined. The dough should be barely cohesive; don't\nworry if there are dry bits, because they will be incorporated as you pat and fold the dough.","Lightly flour your work surface. Transfer the dough there, patting it into a 3/4-inch-thick\nrectangle. Fold the dough in thirds as you would a letter, bringing one-third in over the\nmiddle third, followed by the final third over the other two. Gently roll or pat the dough\ninto another rectangle. Repeat this fold-and-roll process once more if the dough isn’t\ncohesive or if you want to create more layers.","Lightly flour the top of the dough. Use the 2-inch cutter to create 10 to 12 rounds of dough,\nbeing careful to cut straight down and not twist the cutter (to ensure the biscuits get the\n    best rise). You can re-roll the dough once, though you might not get the same rise. Or use\n    the bench scraper or a sharp chef's knife to square the sides and edges of the dough\n    rectangle, then cut 8 to 10 squares or rectangles. Place the biscuits on the baking sheet,\n    spacing them about 2 inches apart.","Bake (upper rack) for 16 to 18 minutes, rotating the pan from front to back after 14 minutes,\n until the biscuits are golden.","If you wish to brush the biscuit tops with melted butter, do so as soon as they come\nout of the oven. Serve warm, or at room temperature."]},{"recipename":"Herbed Cottage Cheese Biscuits","id":6,"category":"Baking","source":"NY Times","ingredient":[{"value":"2","unit":"cups","name":""},{"value":"1/2","unit":"cups","name":"full-fat cottage cheese"},{"value":"1/2","unit":"cups","name":"cold whole milk"},{"value":"1","unit":"tablespoon","name":"baking powder"},{"value":"6","unit":"tablespoon","name":"very cold unsalted butter, cut into small chunks"},{"value":"3","unit":"tablespoon","name":"minced fresh herbs, such as dill, basil, chives, parsley, cilantro or a combination"},{"value":"2","unit":"cups","name":"flour"},{"value":"1/2","unit":"teaspoon","name":"sea salt"},{"value":"1/4","unit":"teaspoon","name":"baking soda"}],"directions":["Center a rack in the oven and preheat the oven to 425 degrees. Line a baking sheet with\n parchment paper or a silicone liner.","Whisk together the flour, baking powder, salt (to taste) and baking soda in a large\n mixing bowl. Whisk together the cottage cheese and milk in a separate bowl.","Scatter the butter and herbs over the flour mixture; toss to coat the butter with flour.\n Use your fingertips or a metal pastry blender to rub, squeeze and/or cut the butter into\n the dry ingredients. You’re aiming for a lumpy mix with pieces of every size and shape,\n from pea-size to flake. It will look rough, and that’s just what you want.","Pour the cottage cheese-and-milk mixture over the dry ingredients; use a fork to\n gently stir everything around until you have a soft dough. Squeeze a piece and it will\n hold together. You might have a few dry spots here and there, but you’re about to take\n care of them. Reach into the bowl and turn, fold and knead the dough -- go easy, it’s\n not bread -- just enough to bring everything together into a ball.","Lightly dust a work surface with flour and turn out the dough. Dust the top of the\n dough very lightly, and either pat the dough out with your hands or roll it with a\n pin until it is between 1/2-inch and 3/4-inch high. Don’t worry if the dough isn’t\n rolled out evenly: A quick, light touch is more important than accuracy here.","Use the cutter; your goal is to cut the biscuits as close to one another as possible,\nso you get the most you can out of this first round. Transfer the biscuits to the baking\nsheet as you work, spacing them at least an inch apart. Gather together the scraps;\nlightly pat the dough out again, working it as little as possible, and cut additional\nbiscuits, again as close together as possible; transfer those to the sheet. You can go\nfor one more pat-and-cut; just know that third-round biscuits won’t rise as dramatically\nas the others; they will, however, be delicious. Keep in mind you're aiming for a total of\n10 biscuits.","(At this point, the biscuits can be frozen till firm, then wrapped airtight and kept\nin the freezer for up to 2 months. Bake without defrosting; just add about 3 more\nminutes to the oven time.)","Bake for 14 to 18 minutes, rotating the baking sheet from front to back halfway through,\nuntil the biscuits are tall, puffed and golden brown. Remove them from the baking sheet\nand serve right away.","VARIATION: You can make more-traditional biscuits by replacing the cottage cheese and\nwhole milk with 3/4 cup of buttermilk. (Or omit the cottage cheese and baking soda and\nincrease the whole milk to 3/4 cup.) If you like sweet biscuits, omit the herbs,\nuse 1/2 teaspoon of salt and add 2 teaspoons of sugar to the dough."]},{"recipename":"Speculoos Cookie Butter Pie","id":7,"category":"Desserts","source":"NY Times","image":"speculoos.jpg","cc":"Constellation Inspiration","wurl":"http://www.constellationinspiration.com/2017/01/speculoos.html","ingredient":[{"value":"1","unit":"","name":"Nonstick cooking spray"},{"value":"227","unit":"grams","name":"Speculoos cookies (About 30)"},{"value":"4","unit":"tablespoons","name":"unsalted butter, melted"},{"value":"8","unit":"ounces","name":"cream cheese, at room temperature (230 g)"},{"value":"1","unit":"cup","name":"speculoos cookie butter"},{"value":"1","unit":"cup","name":"confectioners sugar"},{"value":"1 1/4","unit":"cups","name":"heavy cream"},{"value":"1","unit":"teaspoon","name":"vanilla extract"},{"value":"1/4","unit":"teaspoon","name":"fine sea salt"}],"directions":["Lightly spray a 9-inch pie plate with nonstick spray.","In the bowl of a food processor, pulse the cookies into fine crumbs, about 1 minute.\n It will be about 1 1/2 cups. Add the melted butter and pulse until the mixture is\n uniformly combined and sticks together when pressed, 15 to 20 seconds. Press the crust\n evenly into the base and up the sides of the pie plate. Freeze the crust while you heat\n the oven to 350 degrees.","Bake the chilled crust until it appears set and the edges start to darken slightly, 8\n to 10 minutes. Cool completely.","In the bowl of an electric mixer fitted with the whisk attachment, beat the cream\n cheese and cookie butter on medium speed, 1 to 2 minutes. Scrape down the sides of the\n bowl, then add the confectioners sugar and mix on low speed until fully incorporated,\n 1 to 2 minutes. Scrape down the sides of the bowl.","In a liquid measuring cup with a spout, mix the 1 1/4 cups cream with the vanilla and\n salt to combine. Increase the mixer speed to medium and gradually add the cream mixture\n to the cream cheese mixture in a slow, steady stream. Continue to mix just until the\n mixture has thickened and holds medium peaks, 30 seconds to 1 minute. Do not overwhip,\n which could cause the mixture to separate.","Pour the filling into the cooled pie crust and smooth into an even layer. Freeze the\n pie for 20 minutes to set the filling, then transfer to the refrigerator to chill until\n the filling is firm, about 45 minutes.","Prepare the whipped cream, if using: In the bowl of an electric mixer fitted with the\n whip attachment, whip the remaining 3/4 cup cream to medium peaks. Spread in an even\n layer on top of the chilled pie and garnish with a sprinkling of cookie crumbs, if\n desired. Refrigerate until ready to serve."]},{"recipename":"Cardamom Buns","id":8,"category":"Baking","source":"NY Times","image":"cardamom.jpg","ingredient":[{"value":"1 ¼","unit":"cups","name":"whole milk"},{"value":"2 ¼","unit":"teaspoons","name":"active dry yeast"},{"value":"4","unit":"cups","name":"all purpose flour"},{"value":"¼","unit":"cups","name":"sugar"},{"value":"3","unit":"Tablespoons","name":"sugar"},{"value":"6","unit":"Tablespoons","name":"softened butter"},{"value":"2","unit":"Tablespoons","name":"ground cardamom"},{"value":"1","unit":"teaspoon","name":"fine sea salt"},{"value":"1","unit":"cup","name":"butter, slightly softened"},{"value":"2","unit":"Tablespoons","name":"butter, slightly softened"},{"value":"1","unit":"cup","name":"sugar"},{"value":"2","unit":"Tablespoons","name":"ground cardamom"},{"value":"¼","unit":"teaspoon","name":"fine sea salt"},{"value":"1","unit":"large","name":"egg"},{"value":"3","unit":"Tablespoons","name":"sugar"},{"value":"20","unit":"green","name":"cardamom pods"}],"directions":["PREPARE THE DOUGH: In a small saucepan set over medium-low heat, bring the milk to 105 to\n110 degrees. Remove it from the heat and pour it into a small bowl. Sprinkle the yeast on\ntop, give it a quick whisk and let it rest a few minutes to dissolve and activate. If the\nyeast looks like it’s clumping, whisk it gently.","In the bowl of a stand mixer fitted with the dough hook, combine the flour, sugar, butter,\ncardamom, salt and the yeasted milk. Mix on the lowest setting until just combined and\nbeginning to form a dough, 1 to 2 minutes. Continue on low to knead dough, about 2 minutes.\nIt should go from shaggy and coarse to smooth and shiny. Working inside the bowl, give the\ndough a couple more kneads by hand to bring it together. You can also knead the dough\nentirely by hand on a work surface. (It’ll take 8 minutes or so.)","Line a 9-by-13-inch quarter sheet pan with parchment paper and dump the kneaded dough out\nonto it. Using your hands, pat and shape the dough into a large rectangular block. Make 4\nor 5 shallow, 1/4-inch-deep slashes in the dough with a knife. Cover the baking sheet with\na damp kitchen towel or plastic wrap, and transfer the dough to the refrigerator to chill\nfor 2 hours.","MAKE THE FILLING: In the bowl of a stand mixer fitted with the paddle attachment, beat the\nbutter, sugar, cardamom and salt on low speed just to form a granular paste. (It should\nresemble marzipan.) Don’t overbeat it: You don’t want it to be too soft or get fluffy.\nYou can also do this by hand in a bowl, combining the ingredients with a spatula or bench\nscraper.","Line two 13-by-18-inch baking sheets with parchment paper or silicone mats.","Remove the dough from the refrigerator and let sit at room temperature for a few minutes\nso it’s not so stiff that you can’t roll it out. Place the dough on a thick silicone mat\nor a very lightly floured work surface and use a rolling pin to roll it out to a roughly\n15-by-18-inch rectangle a little more than 1/8-inch thick, with the shorter side facing\nyou. As you roll it in both directions, pause occasionally between rolls to relax the\ndough by patting it, lifting it and pulling it to straighten out any ripples.","Dot the surface of the dough with mounds of the filling. Using an offset spatula, gently\nspread the filling all over the surface of the dough.","With the short side of the dough facing you, fold the top third of the dough down over the\nmiddle third of the dough, then fold the bottom third up to cover the remaining dough.","Go over the dough with the rolling pin a couple of times, vertically, to flatten the edges,\nand stretch it a few more inches before cutting and shaping. You want a 12-by-16-inch\nrectangle (the longer side will be facing you). If any filling oozes out, use your offset\nspatula to remove it so your workstation doesn’t get sticky.","Using the straight edge of a ruler and a pastry cutter (or very gently using a small, sharp\nknife), trim any uneven edges. Cut the dough vertically into 16 1-by-12-inch-long strips.\nStarting from the end, gently wrap one strip around the tips of your index, middle and\nfourth finger (or just the index and middle if you’ve got strong hands), like a bandage,\ntwo or three times, letting the dough overlap and working cautiously so it doesn’t tear. ","Place your thumb on top of the wrapped dough, on the side closer to your wrist, to secure\nthe shape, then loop the remaining end of the strand over and through the center of the\nbun, tucking it under at the base of the bun. You should have a rounded bun made out of\nbandage-like strips. The knotted part will be unexposed, hidden at the bottom.","Place each bun on the prepared baking sheets as you go, patting it down for a flatter\nshape. Space the buns evenly (you can eyeball it). Leave them to proof at room temperature,\nuncovered, for about 1 hour. They should expand and soften.","Meanwhile, heat oven to 450 degrees.","FINISH THE BUNS: In a small bowl, using a fork or whisk, beat the egg together with 1\ntablespoon water until well combined and frothy.","Grind the cardamom pods in a spice grinder, making sure you break down the tough outer husks.\nTransfer the ground spice to a small bowl and whisk it together with the sugar.","Lightly brush each bun with the egg wash, and generously sprinkle the tops of the buns\nwith the cardamom sugar, using about 1/2 teaspoon per bun.","Bake for 8 minutes, then lower temperature to 375 degrees, rotate trays completely (180\ndegrees and top to bottom, bottom to top) and continue baking for an additional 12 minutes.\nThe surface of the buns should be golden brown.","Let the buns cool for 10 minutes before eating, so the spiced, sweet buttery goo that\npools around their edges can harden into crispy candylike edges, or let them cool entirely.","TIP: If you wish to use cardamom pods and grind them yourself for a more intense flavor, use 30\nwhole pods per finely ground tablespoon. (For a less potent flavor that still uses freshly\nground whole pods, use 20 pods per finely ground tablespoon.)","You can also use decorticated cardamom seeds (those extracted from the husks). They're\navailable at specialty stores and online (or you can remove the seeds from fresh cardamom\npods yourself).","Coarsely grind the seeds with a mortar and pestle or an electric spice grinder: You’ll\nwant to use 1 tablespoon whole seeds each for the dough and the filling, but if you're at\nall cardamom-shy, start with 2 teaspoons whole seeds each."]},{"recipename":"Pommes Anna","id":13,"category":"Vegetables","source":"Washington Post","image":"pommes.jpg","ingredient":[{"value":"6","unit":"medium","name":"potatoes, russet"},{"value":"6","unit":"T","name":"butter plus more for brushing"},{"value":"2","unit":"tsp","name":"fresh thyme leaves"},{"value":"1 1/2","unit":"tsp","name":"salt"},{"value":"1/2","unit":"tsp","name":"pepper"}],"directions":["Preheat the oven to 350 degrees with the rack in the middle. Using a mandoline, cut the potatoes into 1/8-inch thin slices. (Do not place sliced potatoes in water; the starch is necessary to bind the layers.)","Brush the bottom of a medium cast-iron skillet with some of the butter. Starting in the center of the pan, arrange a layer of overlapping potato slices over the bottom the skillet. Generously brush the potato layer with butter and season lightly with salt, pepper and a pinch of thyme leaves. Repeat until you run out of potatoes.","Transfer the skillet to the oven and bake until the potatoes are tender and crispy on the top and sides, about 1 hour. Run a small spatula around the edges of the potatoes; slide a large spatula underneath the potatoes to loosen them. Carefully invert onto a plate and cut into wedges; or cut into wedges in the skillet and serve."]},{"recipename":"Proper British Shortbread","id":14,"category":"Baking","source":"Washington Post","image":"shortbread.jpg","ingredient":[{"value":"16","unit":"tablespoons (2 sticks/226 grams) ","name":"butter"},{"value":"1/2","unit":"cup","name":"sugar"},{"value":"1 2/3 cups","unit":"cups","name":"flour"},{"value":"1/2","unit":"cup","name":"semolina"},{"value":"2","unit":"T","name":"demerara sugar"}],"directions":["With only five ingredients and barely 20 minutes of prep time, this is a recipe you can throw together with little planning — or stress. And yes, there’s just one bowl needed.","Preheat the oven to 325 degrees with a rack in the middle position. Have ready a 9-by-13-inch baking pan.","In the bowl of a stand mixer fitted with the paddle attachment, beat together the butter and sugar on low speed just until combined. (You’re only looking to incorporate them, not add a lot of air to the mixture.) Alternately, you can use a handheld mixer or even a wooden spoon in a large bowl.","Stir in the flour and semolina on low speed until combined. The dough won’t come together into a cohesive mass, so don’t be surprised if it’s crumbly. Clumps, however, should form when pressed together between your fingers. You can briefly knead the dough by hand, if needed.","Press the mixture into the pan, level and smooth the top using the bottom of a dry measuring cup or the back of a spoon. Sprinkle with the raw, coarse demerara sugar, and bake for about 30 to 35 minutes, until pale golden brown.","Remove from the oven and let the pan cool on a wire rack for 5 minutes. With the tip of a sharp knife, score the slab to form 24 triangles (we accomplished this with three rows of four squares that we then cut in half). Let the shortbread cool completely in the pan before lifting out the pieces."]},{"recipename":"New Orleans King Cake","id":15,"category":"Desserts","source":"Saveur.com","image":"kingcake.png","ingredient":[{"value":"2 1/4","unit":"tsp","name":"active dry yeast"},{"value":"1/4","unit":"cup","name":"sugar"},{"value":"1/4","unit":"cup","name":"water, heated"},{"value":"1/2","unit":"cup","name":"whole milk"},{"value":"2","unit":"T","name":"light brown sugar"},{"value":"1","unit":"tsp","name":"vanilla extract"},{"value":"1","unit":"large","name":"egg"},{"value":"1","unit":"large","name":"egg yolk"},{"value":"2 3/4","unit":"cup","name":"flour"},{"value":"3/4","unit":"tsp","name":"salt"},{"value":"8","unit":"T","name":"unsalted butter, softened"},{"value":"2","unit":"T","name":"unsalted butter, melted and cooled"},{"value":"1/2","unit":"cup","name":"cream cheese, softened"},{"value":"1/3","unit":"cup","name":"confectioners sugar"},{"value":"1/4","unit":"tsp","name":"ground cinnamon"},{"value":"1/2","unit":"large","name":"lemons zest"},{"value":"2","unit":"cups","name":"confectioners sugar"},{"value":"2","unit":"T","name":"whole plain Greek yogurt"},{"value":"1","unit":"tsp","name":"vanilla extract"},{"value":"1/2","unit":"large","name":"lemons zest"},{"value":"1","unit":"tsp","name":"buttermilk or milk"},{"value":"","unit":"","name":"purple, green and gold sanding sugars"}],"directions":["Make the dough: In the bowl of a stand mixer fitted with the whisk attachment, combine the yeast,\n          1/2 teaspoon granulated sugar and 1/4 cup water on medium speed until the yeast dissolves, about 2 minutes.\n          If necessary, whisk by hand to reach down deep into the bowl. Let sit until foamy, about 10 minutes.","Add the remaining granulated sugar, milk, light brown sugar and vanilla. In a small bowl or liquid measuring cup,\n          lightly beat together the egg and egg yolk and add to the mixer bowl. Beat the mixture on low speed until thoroughly\n          combined, about 2 minutes.","Turn the mixer off and switch to the dough hook attachment. Add the flour and salt. Mix on medium speed until the dough\n          just comes together, about 1 to 2 minutes, scraping down the sides of the bowl. Then, knead the dough for 3 to 4 minutes.","Add the butter and continue kneading until the dough is smooth and all the butter is incorporated. The dough should begin\n          to pull away from the sides of the bowl after about 6 minutes. If the dough does not pull away, use a rubber spatula to\n          scrape down the sides of the bowl, forming the dough into a ball.","Remove the bowl from the mixer, cover with a clean kitchen towel, and place in a warm spot to rise until the dough has\n          doubled in size, 1 1/2 to 2 hours.","Make the filling: In a small bowl, combine the melted and cooled butter, softened cream cheese, confectioners’ sugar,\n          cinnamon and lemon zest. Whisk until thoroughly combined. The filling should be glossy and easily spreadable.","Shape the cake: Punch down the dough. Place it on a heavily floured surface. Using a floured rolling pin, roll the\n          dough into a large circle, 16 to 18 inches in diameter and 1/4-inch thick. Punch a hole in the center of the circle\n          with your finger. Then widen the circle to about 3 inches. Using the back of a spoon or an offset spatula, spread\n          the filling evenly around the ring of dough, halfway between the outer edge and inner circle, leaving about a 1-inch\n          border on each side.","Gradually fold the outside edge of the dough over the filling to meet the inner edge, continuing until the filling\n          is covered, widening the center hole as you go. The hole should be about 8 inches wide when finished. Make sure the\n          seams of the dough are well sealed by gently pinching the dough as needed. If necessary, dampen your fingers a bit\n          and pinch to seal the dough. This prevents the filling from seeping out during baking.","Line a rimmed baking sheet with parchment paper and place it next to the dough circle. Lift one end of the dough\n          circle and place it on the sheet pan; then lift the other end onto the pan. Gently reform the dough into an oblong or\n          rectangle on the pan, leaving at least an inch or two from the rim. Check to see that all seams remain sealed. Cover\n          with a clean kitchen towel. Let it rest for 1 hour at room temperature until slightly puffed.","Half an hour before the cake finishes proofing, position the rack in the middle position and preheat the oven to 350 degrees.","Remove the towel from the cake. Bake until golden brown and dry to the touch, 20 to 25 minutes. Using the parchment paper, lift\n          the cake from the sheet pan and move it to a wire rack. Let the cake cool completely before decorating, at least 1 hour.","While the cake is cooling, make the glaze. In a medium bowl, combine the confectioners’ sugar, yogurt, lemon zest and vanilla.\n          Add the buttermilk or milk gradually, whisking until the glaze is smooth and fluid enough to drizzle over the cake.  Add more\n          liquid, 1 teaspoon at a time, as needed to achieve the proper consistency.","Line a serving platter with wax or parchment paper. Transfer the cake to the platter.","Drizzle the glaze generously onto the cake, allowing it to drip down the sides. Sprinkle the cake with the sanding\n          sugars, alternating strips of purple, green and gold. Allow the glaze to set for about 10 minutes. Gently lift the\n          decorated cake and slide it off the paper onto a platter.","Slice and serve."]},{"recipename":"Tarte Tatin","id":16,"category":"Desserts","source":"Washington Post Adapted from Jacques Torres","image":"tatin.jpg","ingredient":[{"value":"1","unit":"recipe","name":"pie dough, homemade or store-bought"},{"value":"8","unit":"large","name":"Golden Delicious apples, about 4 pounds "},{"value":"7","unit":"T","name":"unsalted butter, cut into pieces"},{"value":"1","unit":"cup","name":"granulated sugar"},{"value":"","unit":"","name":"Vanilla ice cream, creme fraiche, creme anglaise or caramel sauce for serving (optional)"}],"directions":["Keep the heat low. Some chefs, such as Greg Lloyd at Washington’s Le Diplomate and Anne Specker at Kinship and Métier, start with a ripping hot caramel. But when you make caramel out of molten sugar and then add cold apples, the hot sugar can sputter angrily. There is an easier way. “We always started with a pan of butter and sugar,” Senne recalls. “You melt unsalted butter in a pan over low heat, and then add sugar, just enough so it absorbs into the melted butter until the mixture looks like wet sand.” Then, you stand peeled and cored apple halves in the pan, packing them tightly, and cook it all on a low flame until the apples are deeply caramelized. “The low flame is important, because it allows the apples to slowly dehydrate and release their moisture into the caramel,” Senne notes.","I asked Francisco Migoya, head chef at Modernist Cuisine in Seattle, to break it down for me. “What’s happening, chemically, when you cook apples in sugar and butter very slowly is that the water in the apple is evaporating and being replaced by sugar, causing it to become translucent. Then, the pectin the apples contain is being activated as they heat up, creating a gel-like texture, which is enhanced when the sugar interacts with the apple’s malic acid,” he says. Butter helps form a soft caramel and adds flavor.","Longtime pastry chef Jacques Torres, co-host of the Netflix hit “Nailed It!,” said he considered every factor when he developed his recipe for tarte tatin, published in his first cookbook, “Dessert Circus” (1997). It’s a lot like Senne’s version. “You don’t need to start with a caramel,” he said. “Apples contain so much pectin that if you cook them with sugar they will caramelize and set. They don’t need much help.”","Pick the right apple. Torres likes Golden Delicious, as does Senne, who learned the recipe when she studied at Anne Willan’s French cooking school, La Varenne. “Chef Fernand Chambrette was my teacher, and he always talked about ‘les Goldens,’ ” Senne recalls. “That was the only apple we used because it held its shape and had an interesting, not-too-candy-sweet flavor.”","Skip the puff pastry. So many great chefs, including Lloyd, Torres and Daniel Skurnick at Le Coucou in New York, swear by puff pastry. “It offers this crisp counterpoint to the soft apples,” Skurnick says. Torres and Skurnick bake the pastry separately — not on top of the apples, as is traditional — to ensure it stays crisp, before inverting the apples onto it just before serving. This textural contrast can indeed be nice — if you’re at a restaurant and someone else is doing all the work. Puff pastry is an incredible dough, but unless it’s made properly, baked perfectly and kept at the right humidity, it has a tendency to get slightly damp and tough. That means a slice on the plate will require the use of a knife.","Using a lightly floured rolling pin, roll out the pie dough on a lightly floured surface to about 1/8- to 1/4-inch thick. Take the skillet you will cook the apples in and place it upside down on the pastry, then use a sharp knife to cut around the perimeter of the skillet. Refrigerate the circle of dough until ready to use.","Use a vegetable peeler to peel the apples. Cut the apples in half from top to bottom through their core. Using a melon baller, scoop out the seeds from each half. Using a small sharp knife, trim away any core or stem.","In a ovenproof 10-inch, stainless steel — nonstick or not — high-sided skillet, over medium-low heat, melt the butter. Turn off the heat and sprinkle the sugar over the melted butter, letting it completely absorb, until it looks like wet sand.","Arrange 13 apple halves, stem side down, atop the sugar and butter in a circle at the perimeter of the pan. Apples should be nestled very tightly together. Fit the remaining three apple halves into the center. (If you can’t fit all the apple pieces in, continue with the recipe; you’ll be able to add additional halves as the fruit cooks and starts to shrink.)","Over medium-low heat, bring the mixture to a rapid simmer for about 5 minutes. Turn the heat to very low, and cook, rotating the pan occasionally, for 60 to 70 minutes. (Within the first 10 minutes of cooking, the apples will begin to shrink. This is when you can wiggle any additional pieces into the pan.) Keep an eye on the apples as they cook. They will release their juices as the sugar begins to caramelize. Lower the heat further if the juices start to bubble up over the side of the pan. As the apples shrink, with a spoon or spatula, coax them to lean on one another, as this will produce a prettier tart once inverted.","After about 1 hour, the apples will have shrunk significantly. Using a fork or tongs, gently pluck one out to check the color. The parts of the apples that were in contact with the pan should be between toasted hazelnut and deep chestnut in color. Turn off the heat, and cool slightly, at least 30 minutes. (At this point, the apples may be cooled, covered and refrigerated in the pan for up to 2 days. Rewarm over low heat before proceeding with the recipe.)","Place the rack in the center of the oven and preheat to 400 degrees.\nRetrieve the dough from the refrigerator and gently lay it over the apples.\nPlace the skillet on a large, rimmed baking sheet and put it in the oven. Bake the tart 35 to 40 minutes, until the pastry is the color of almond skin.","Let the tart cool in the pan for 1 to 2 minutes. Place a plate that’s slightly larger than the skillet on top, ensuring that the rim clears the edge of the skillet on all sides. Using oven mitts, grip the pan in one hand and plate in the other and, over a sink, quickly and carefully flip the hot skillet — away from you — so the tart inverts onto the plate.","The tart may have shifted in its descent; use a spoon to nudge the apples back into formation. Let cool for at least 20 minutes, then serve as is, or with vanilla ice cream, creme fraiche, creme anglaise or caramel sauce."]},{"recipename":"Stuffed Chicken Roll-Up","id":17,"category":"Chicken","source":"Washington Post","image":"stuffed_chicken.jpg","ingredient":[{"value":"6","unit":"oz","name":" (about 3/4 cup) fresh spinach"},{"value":"1","unit":"large","name":"Finely grated zest and juice of lemon"},{"value":"1","unit":"pound","name":"2 chicken breasts, skinned, deboned and thinly sliced into cutlets)"},{"value":"1","unit":"cup","name":"breadcrumbs"},{"value":"4","unit":"oz","name":"Swiss cheese"},{"value":"1","unit":"T","name":"Worcestershire sauce"},{"value":"1","unit":"T","name":"butter, melted"},{"value":"2","unit":"T","name":"minced garlic (shallots or sweet onion also fine)"},{"value":"2","unit":"T","name":"water"},{"value":"","unit":"","name":"extra virgin oil"}],"directions":["Position the rack in the middle of the oven and preheat to 375 degrees.","Place the water in a glass bowl and add the spinach and garlic. Toss to combine. Place the bowl\n        in the microwave and cook on HIGH for 2 to 3 minutes, or until the spinach is wilted and tender.\n        Stir the lemon zest into the spinach.","Brush each cutlet with oil and dredge both sides in the bread crumbs. Lay a cutlet flat and spoon\n         a quarter of the spinach mixture onto meat, spreading it evenly in the center of the cutlet and\n         leaving about 1/4-inch border around the edges. Layer a quarter of the cheese on top of the spinach.\n         Carefully roll the chicken up and secure with a toothpick. Repeat with the remaining ingredients.","Lightly grease a medium baking dish with more of the oil and place the chicken rolls in the dish.\n         (It’s okay if they touch.) Pour the lemon juice and Worcestershire sauce over the chicken, then finish\n         with a drizzle of the melted butter.","Bake, uncovered, for 25 to 30 minutes, or until the internal temperature reads 165 on an instant-read\n         thermometer. Do not overbake, or the chicken will be dry."]},{"recipename":"Chicken Marsala","id":18,"category":"Chicken","source":"California Health & Longevity Institute","image":"chicken_marsala.png","intro":"This Chicken Marsala recipe is for four(4) servings, at 250 calories per serving and provides 4 oz of protein.","ingredient":[{"value":"4","unit":"","name":"boneless, skinless chicken breasts"},{"value":"2","unit":"T","name":"flour"},{"value":"1","unit":"tsp","name":"salt"},{"value":"","unit":"","name":"black pepper"},{"value":"1","unit":"T","name":"olive oil"},{"value":"1","unit":"T","name":"margarine"},{"value":"2","unit":"cups","name":"sliced mushrooms"},{"value":"1/2","unit":"cup","name":"chicken broth"},{"value":"1/3","unit":"cup","name":"marsala wine"},{"value":"2","unit":"T","name":"parsley, chopped"}],"directions":["Pound chicken breast 1/4 inch thick between plastic wrap.\n        Place flour, salt, and pepper in large zip lock bag.  Add chicken breasts, two at a time,\n        and shake well to lightly coat with flour, place on plate.","Add olive oil to large nonstick sauté pan, add chicken breast and brown for\n       3 minutes, turn over and brown other side for 1 minute.  Add 2 Tbsp. water to\n       sauté pan lid and quickly place on pan to steam chicken breast for 1 minute.\n       Remove lid and transfer chicken breast to clean platter and place in warm oven.","Add margarine to sauté pan, melt over medium heat.  Add mushrooms and sauté\n       for 3-4 minutes, add Marsala wine and cook for an additional 2-3 minutes.","Add chicken breast to mushrooms; add chicken broth and parsley, turning chicken\n       to coat with sauce.  Simmer for 2 minutes until sauce thickens.","Served with broccoli and pasta but did not include this in the recipe"]},{"recipename":"Shrimp Remoulade","id":19,"category":"Seafood","source":"Saveur","image":"shrimp_remoulade.jpg","cc":"Christopher Hirsheimer for Saveur","wurl":"https://www.saveur.com/story/recipes/shrimp-remoulade/","intro":"Classic, tangy remoulade sauce is a luxurious accompaniment to any crustacean.","ingredient":[],"directions":[]},{"recipename":"Poached Eggs","id":20,"category":"Eggs","source":"The Incredible Egg, incredibleegg.org","image":"poached.jpg","cc":"Stacy Zarin Goldberg for The Washington Post","intro":"Bring a few inches of water to a boil, reduce the heat so it’s just simmering (gently bubbling) and slip in the egg, letting it cook for 3 to 5 minutes. The site even warns, in italics, “do not stir.” Okay, sounds great!","ingredient":[{"value":"2-4","unit":"large","name":"EGGS, cold"}],"directions":["Do not swirl the water when poaching eggs. This creates a vortex that will ruffle the delicate egg protein. Relatively quiet water that is gently simmering produces the best result.","Use very fresh eggs for poaching. They hold their shape better and form fewer wispy threads or “angel wings” in the water.","HEAT 2 to 3 inches of water in large saucepan or deep skillet to boiling. ADJUST heat to keep liquid simmering gently.","BREAK eggs one at a time into custard cup or saucer. Holding dish close to surface, SLIP egg into water.","COOK eggs until whites are completely set and yolks begin to thicken but are not hard, 3 to 5 minutes. Do not stir. LIFT eggs from water with slotted spoon. DRAIN in spoon or on paper towels. ","TRIM any rough edges if desired. SPRINKLE with salt and pepper. SERVE immediately."]},{"recipename":"Whipped Coffee","id":21,"category":"Drinks","source":"NY Times","image":"coffee.png","cc":"Vaughn Vreeland","intro":"Instant coffee whipped with sugar and water and poured over milk has become an internet\n              sensation in recent months.\n              Known as whipped coffee, or dalgona coffee, the drink is made by whipping instant coffee with\n              sugar and water, resulting in a butterscotch-hued foam that’s spooned over milk.","ingredient":[{"value":"2","unit":"T","name":"instant coffee"},{"value":"1/2","unit":"T","name":"sugar"},{"value":"2","unit":"T","name":"hot water"},{"value":"","unit":"","name":"cold or hot milk"},{"value":"","unit":"","name":"ice"}],"directions":["To make one drink, combine 2 tablespoons granulated instant coffee, 1/2 tablespoon sugar and 2 tablespoons hot water in a medium bowl. (You can use up to 2 tablespoons sugar for a sweeter drink.)","Whip, by hand or with a mixer.","Continue mixing until the mixture turns from foamy to frothy to creamy.","Spoon the fluffy mixture over milk in a glass filled with ice. (You could also spoon it over warm milk for a hot drink.)","Combine and serve."]},{"recipename":"DoubleTree Hotel Chocolate Chip Cookie","id":22,"category":"Baking","source":"Hilton","image":"chip.png","intro":"DoubleTree cookies have a passionate fan following and a long history. More than 30 million are consumed every year, and the DoubleTree chocolate chip cookie even became the first food to be baked in orbit during experiments aboard the International Space Station. ","ingredient":[{"value":"1/2","unit":"pound","name":"butter, softened (2 sticks)"},{"value":"","unit":"¾ cup + 1 tablespoon","name":"sugar"},{"value":"¾","unit":"cup","name":"packed light brown sugar"},{"value":"2","unit":"large","name":"eggs"},{"value":"1 ¼","unit":"tsp","name":"vanilla extract"},{"value":"¼","unit":"tsp","name":"freshly squeezed lemon juice"},{"value":"2 ¼","unit":"cups","name":"flour"},{"value":"1/2","unit":"cup ","name":"rolled oats"},{"value":"1","unit":"teaspoon","name":"baking soda"},{"value":"1","unit":"teaspoon","name":"salt"},{"value":"1 3/4","unit":"cups","name":"chopped walnuts"},{"value":"2 2/3","unit":"cups","name":"chocolate chips"},{"value":"","unit":"pinch","name":"cinnamon"}],"directions":["Cream butter, sugar and brown sugar in the bowl of a stand mixer on medium speed for about 2 minutes. ","Add eggs, vanilla and lemon juice, blending with mixer on low speed for 30 seconds, then medium speed for about 2 minutes, or until light and fluffy, scraping down bowl. ","With mixer on low speed, add flour, oats, baking soda, salt and cinnamon, blending for about 45 seconds. Don’t overmix. ","Remove bowl from mixer and stir in chocolate chips and walnuts.","Portion dough with a scoop (about 3 tablespoons) onto a baking sheet lined with parchment paper about 2 inches apart. ","Preheat oven to 300°F. Bake for 20 to 23 minutes, or until edges are golden brown and center is still soft. ","Remove from oven and cool on baking sheet for about 1 hour.","Cook’s note: You can freeze the unbaked cookies, and there’s no need to thaw. Preheat oven to 300°F and place frozen cookies on parchment paper-lined baking sheet about 2 inches apart. Bake until edges are golden brown and center is still soft."]},{"recipename":"Fresh Tomato Sauce","id":29,"category":"Sauces","source":"","image":"sauce2.jpg","intro":"The recipe comes from Lynne Rossetto Kasper, formerly of “The Splendid Table” radio show. Her sauce was maybe a bit on the watery side. To compensate, I switched to Roma tomatoes, which are meatier and contain less liquid. There’s a reason they’re often referred to as “paste tomatoes.” Part of me felt guilty doing this, because Rossetto Kasper’s recipe explicitly states “never Romas of any kind,” but I also believe that you get a fair assessment first by preparing a recipe as written and then by trying some informed, reasonable changes. I made a few other nips and tucks — a little less onion here, a little more salt there — and added a tablespoon of tomato paste for a jump-start on a more intense savory, long-cooked flavor.","notes":"This revision blew the tasting panel away. It struck the right balance between sweet and acidic, bright and rich. The sauce is naturally at home on pasta, but it would also be great on sandwiches and pizza and as a base for a soup or braise. It’s charming as a chunky, more rustic sauce; we also liked using an immersion blender to partially blend it into a more cohesive whole.","ingredient":[{"value":"5","unit":"","name":"cloves garlic, coarsely chopped"},{"value":"12","unit":"","name":"large fresh basil leaves, torn"},{"value":"1/2","unit":"teaspoon","name":"sea salt, or more as needed"},{"value":"1/4","unit":"medium","name":"onion, chopped"},{"value":"1/4","unit":"cups","name":"extra-virgin olive oil"},{"value":"1/8","unit":"teaspoon","name":"freshly ground black pepper, or more as needed"},{"value":"1","unit":"T","name":"tomato paste"},{"value":"3 1/2","unit":"pounds","name":"plum or Roma tomatoes, cored and quartered"}],"directions":["In a 4-quart saucepan, combine the garlic, basil, onion, salt, pepper, tomato paste and olive oil. Heat over medium-high heat for 30 seconds; you should be able to smell the ingredients, but they shouldn’t be burning. Add the tomatoes, breaking them up a bit more with your hands as they go into the pan. Bring to a lively bubble, uncovered, and cook 30 minutes, or until the sauce is thick and reduced by half. Stir often, watching for sticking or scorching.","Remove the pan from the heat, cover, and let stand 15 minutes. Taste and season with more salt and pepper, if needed.","If you prefer a smoother texture, pass the sauce through a food mill or process it with a blender, immersion blender or food processor. Serve warm, with pasta or your dish of choice."]},{"recipename":"Big-Batch Tomato Sauce","id":30,"category":"Sauces","source":"","image":"sauce.jpg","cc":"Tom McCorkle for The Washington Post","intro":"This sauce is basic, but in a good way. Simplicity and pantry-friendly ingredients are its\n      hallmarks. The recipe makes a little less than 1 1/2 gallons of sauce that can then be portioned for\n      use in a variety of dishes, such as shakshuka, pizza or pasta sauce. Measure the sauce into the portions\n      needed for each recipe you plan to make with it. Label each package with the ounces it contains, as\n      well as the date, and freeze it. Then you have a leg up on your next meal prep. The sauce is\n      deliberately simple so it can serve as a foundation. Just add fresh or dry seasonings to a make a sauce\n      for your favorite Mexican, Italian, Mediterranean or Indian dishes.","notes":"Store in an airtight container in the refrigerator for up to 5 days, or in the freezer for up to 6 months.","ingredient":[{"value":"1","unit":"(28-ounce) can","name":" no-salt-added tomato sauce"},{"value":"4","unit":"(28-ounce) cans","name":"no-salt-added whole peeled tomatoes, plus their juices"},{"value":"9","unit":"","name":"garlic cloves, minced or mashed"},{"value":"1/2","unit":"cups","name":"extra-virgin olive oil"},{"value":"3","unit":"cups","name":"chopped Vidalia onions or other sweet onion, about 6 medium onions"},{"value":"3","unit":"T","name":"Italian seasoning mix"},{"value":"3","unit":"","name":"bay leaves"},{"value":"2","unit":"teaspoon","name":"black pepper"},{"value":"4","unit":"teaspoon","name":"kosher salt, plus more as needed"}],"directions":["In an 8-quart pot over medium-high heat, heat the oil until just shimmering. Add the onion and\n          lower the heat to medium. Cook until softened, about 10 minutes, stirring occasionally. Add the\n          garlic and cook, stirring, until aromatic, about 2 minutes. Add the Italian seasoning and stir to\n          combine. Over a medium bowl, use your hands to crush the tomatoes and add them to the pot with\n          their juices. Stir to combine. Then, add the tomato sauce and bay leaves and stir to combine.","Raise the heat under the pot and bring the sauce to a boil, about 6 minutes, stirring frequently.\n          Then, reduce the heat to low and simmer, covered, stirring occasionally, until the tomatoes begin to\n          break up and the sauce thickens a bit, about 1 1/2 hours. Add the salt and pepper, then taste and\n          adjust with more salt and/or pepper as desired.","Remove from the heat, and, if desired, blend with an immersion blender to smooth remaining chunks of\n          onion and tomato. If not using right away, cool completely before storing."]},{"recipename":"Red Gravy","id":31,"category":"Sauces","source":"Ann Maloney","image":"redgravy.jpg","cc":"Ann Maloney/The Washington Post","intro":"","notes":"","ingredient":[],"directions":[]},{"recipename":"Simple Tomato Sauce","id":37,"category":"Sauces","source":"NY Times","image":"marinara.png","cc":"Aya Brackett for The New York Times","intro":"This simple, savory sauce is rich with tomato flavor. A few basil stems — or whatever herbs you’ve\n      got on hand — add a welcome aromatic note, and a little zip with a blender or food mill leave it\n      with a smooth, silky texture. ","notes":"Use in lasagna, pasta, pizza, or anywhere else you’d use a jar of store-bought marinara.","ingredient":[{"value":"28 ounce","unit":"can","name":"whole peeled, diced, crushed or puréed tomatoes"},{"value":"4","unit":"","name":"garlic cloves, thinly sliced"},{"value":"5","unit":"","name":"basil stems (optional)"},{"value":"","unit":"","name":"fine sea salt"},{"value":"5","unit":"cups","name":"diced yellow onions, red onions or shallots"},{"value":"¼","unit":"teaspoon","name":"red-pepper flakes (optional)"},{"value":"6","unit":"T","name":"extra-virgin olive oil"},{"value":"2","unit":"T","name":"tomato paste (optional)"}],"directions":["Set a medium Dutch oven or similar pot over medium heat, and add 4 tablespoons olive oil. When the oil shimmers, add onions and a pinch of salt. Reduce heat to medium-low\n          and cook, stirring regularly, until onions are lightly golden and tender, 16 to 18 minutes.","In the meantime, pour the tomatoes into a large bowl and use hands to crush, if using whole tomatoes. Pour about 1 1/2 cups water into the can and swirl to rinse any\n          remaining purée off the sides. Add the water to tomatoes in bowl and set aside.","Once onions are soft and golden, add garlic and cook, stirring, until it threatens to turn golden, about 90 seconds. Add tomato paste, if using, and cook until color deepens, about 3 minutes. Add tomatoes and season with salt. If using, add basil stems and red-pepper flakes. Stirring regularly, allow sauce to come to a boil, then reduce heat to low,\n          cover and simmer until sauce tastes savory and all raw tomato flavor is gone, about 45 minutes.","Taste and adjust seasoning with salt and add remaining 2 tablespoons oil. Use a hand blender to purée, pass through a food mill or let cool, then purée using a blender or food processor.\n          Tomato sauce can be made 1 day in advance and refrigerated or frozen up to 3 months."]},{"recipename":"Oven Fried Chicken","id":51,"category":"Chicken","source":" Manuel Roig-Franzia","image":"ovenchicken.jpg","cc":"Tom McCorkle for The Washington Post","intro":"","notes":"The recipe demands that you crush the rosemary, rather than chop it. I’ve always marveled over\n            the magic of this step. Something about that small change unlocks the\n            scents of that husky herb in a way you can never achieve with a knife.","ingredient":[{"value":"3","unit":"pound","name":"chicken, cut into 8 to 10 pieces"},{"value":"1/2","unit":"cup","name":"biscuit mix, such as Bisquick"},{"value":"3","unit":"T","name":"cornmeal"},{"value":"1 1/2","unit":"tsp","name":"finely chopped or ground fresh rosemary or 1 teaspoon crushed dry rosemary"},{"value":"1","unit":"tsp","name":"fine sea salt or table salt"},{"value":"4","unit":"T","name":"(1/2 stick) unsalted butter, cut into small pieces"},{"value":"1","unit":"tsp","name":"sweet paprika"},{"value":"1/4 ","unit":"tsp","name":"garlic powder"},{"value":"1/2","unit":"tsp","name":"freshly ground black pepper"}],"directions":["Place a rack in the middle of the oven and preheat to 375 degrees.  Place a paper bag inside\n          another paper bag to reinforce it. Then, in the inner paper bag combine the biscuit mix, cornmeal,\n          rosemary, salt, paprika, garlic powder and pepper. (You may also use a food container with a\n          tight fitting lid rather than the bags.)","Spray the rack of a broiler pan with nonstick spray.  In a shallow microwave-safe bowl, melt\n          butter in the microwave on HIGH for about 1 minute. Working with a few pieces at a time, dip\n          the chicken into the melted butter. Gently shake the chicken pieces and use your fingers to\n          remove excess butter, allowing it to drip back into the bowl.","Place the buttered chicken in the bag, or container, and gently shake to coat.\n           Shake off the excess coating from each piece, then place the pieces on the broiler rack, so they\n           are not touching. Breasts and thighs should be bone-side down.\n           Bake, uncovered, for 1 hour until golden brown and the skin is crisp. Let the chicken rest 5\n           minutes before serving."]},{"recipename":"Hero Submarine","id":52,"category":"Sandwiches","source":"Bon Appetit","image":"hero_8.png","cc":"Adam Rapaport","intro":"Sandwich making is not cooking but architecture.  You build a sandwich, Adam says.","notes":"Pour the olive oil and vinegar over the meats and sprinkle with oregano.","ingredient":[{"value":"","unit":"","name":"Provolone Cheese"},{"value":"","unit":"","name":"Mortadella (Italian Bologne)"},{"value":"","unit":"","name":"Soppresssata (Basic Salami)"},{"value":"","unit":"","name":"Parmacotto (Cooked Ham)"},{"value":"","unit":"","name":"Spicy Coppa"},{"value":"","unit":"","name":"Calabrian Chile Pepper Spread"},{"value":"","unit":"","name":"Mayonnaise"},{"value":"","unit":"","name":"Red onion, sliced super thinly"},{"value":"","unit":"","name":"Olive oil"},{"value":"","unit":"","name":"Red wine vinegar"},{"value":"","unit":"","name":"Dried oregano"},{"value":"","unit":"","name":"Sub buns"},{"value":"","unit":"","name":"Shredded iceberg lettuce"},{"value":"","unit":"","name":"Chicago Giardiniera (spicy pickles but not sure how he uses them, see pic.)"}],"directions":["Spread one slice with Calabrian chile pepper spread.  The other slice with\n            mayo or both slices with mayonnaise.\n            Meats must be shaved and draped like handkerchief over sandwich. Waves of meat!\n            Soppressata which is basic salami, Mortadella  which is Italian bologne,\n            Parmacotto which is cooked ham and Spicy Coppa.","Shredded iceberg lettuce and then very very thinly sliced ribbons of red onion\n            which you have soaked ice water to get rid of the bitterness.  Top with\n            deli sliced provolone cheese.  Olive oil and\n            red wine vinegar and sprinkle the top with dried oregano."]},{"recipename":"Parmesan Butter Pasta","id":61,"category":"Pasta","source":"Bon Appetit","image":"saucy_pasta.png","cc":"Adam Rapaport","intro":"","notes":"","ingredient":[{"value":"","unit":"handful","name":"salt for cooking the pasta"},{"value":"4","unit":"cloves","name":"garlic, smashed "},{"value":"","unit":"","name":"Olive oil"},{"value":"","unit":"","name":"Butter"},{"value":"1","unit":"ladelful","name":"pasta water"}],"directions":["Your pasta water should have the salinity of sea water.  Cook pasta and reserve 1 cup of\n         the pasta water","Heat olive oil and cook the smashed garlic cloves right until they are pink.  Turn off\n         the heat, cover the pan and let the cloves sit in the pan until nice and soft.","Add 1 ladel of the pasta water and some butter, scoop the pasta directly from the pot, no need\n         to pass it through the sieve.  Start tossing it in the sauce.","At the end, after you turn off the heat, add grated parmesan which brings the sauce and the whole thing together."]},{"recipename":"Broccoli Pasta","id":62,"category":"Pasta","source":"Bon Appetit","image":"broccoli_pasta.png","cc":"","intro":"","notes":"","ingredient":[{"value":"1","unit":"handful","name":"salt for cooking the pasta"},{"value":"4","unit":"cloves","name":"garlic, smashed "},{"value":"2","unit":"cups","name":"Broccoli, chopped, lightly boiled and sauteed"},{"value":"","unit":"","name":"Olive oil"},{"value":"","unit":"","name":"Butter"},{"value":"1","unit":"ladelful","name":"pasta water"}],"directions":["Your pasta water should have the salinity of sea water.  Cook pasta and reserve 1 cup of\n         the pasta water","Heat olive oil and cook the smashed garlic cloves right until they are pink.  Turn off\n         the heat, cover the pan and let the cloves sit in the pan until nice and soft about 10 minutes.","Add 1 ladel of the pasta water and some butter, scoop the pasta directly from the pot, no need\n         to pass it through the sieve.  Start tossing it in the sauce.","At the end, after you turn off the heat, add grated parmesan which brings the sauce and the whole thing together.","VARIATIONS: Take one or two San Marzano tomatoes, smash it over the olive oil/garlic in the pan, chop\n         a few chili peppers (or basil leaves?), you have another kind of pasta.","MORE VARIATIONS: Chop broccoli, cook a little in the pasta water, throw in the olive oil/garlic pan to\n         sautee."]},{"recipename":"San Marzano Tomato Pasta","id":63,"category":"Pasta","source":"Bon Appetit","image":"san_marzano_pasta.png","cc":"Adam Rapaport","intro":"","notes":"","ingredient":[{"value":"1","unit":"real handful","name":"salt for cooking the pasta"},{"value":"4","unit":"cloves","name":"garlic, smashed "},{"value":"","unit":"","name":"Olive oil"},{"value":"","unit":"","name":"Butter"},{"value":"","unit":"","name":"Canned San Marzano Tomatoes"},{"value":"1","unit":"ladelful","name":"pasta water"}],"directions":["Your pasta water should have the salinity of sea water.  Add 1 full handful of salt to\n         your water.  Cook pasta and reserve 1 ladel of\n         the pasta water.  Looks about half a cup.","Heat olive oil and cook the smashed garlic cloves right until they are pink.  Take 1-2\n         marzano tomatoes.  Crush those right into the pan.  You may also chop  some basil leaves.  Cook and turn off\n         the heat, cover the pan and let the cloves sit in the pan until nice and soft.","Add 1 ladel of the pasta water and some butter, scoop the pasta directly from the pot, no need\n         to pass it through the sieve.  Start tossing it in the sauce.","At the end, after you turn off the heat, add grated parmesan which brings the sauce and the whole thing together."]},{"recipename":"Spaghetti & Meatballs","id":74,"category":"Pasta","image":"pasta.jpg","source":"Bonnie Benwick adapted from Martha Stewart ","intro":"You're craving the comfort of spaghetti and meatballs. This 30-minute recipe delivers.","ingredient":[{"value":"6","unit":"stems","name":"fresh parsley"},{"value":"2","unit":"cloves","name":"garlic"},{"value":"1","unit":"2-ounce piece","name":"Parmigiano-Reggiano cheese, for serving"},{"value":"8","unit":"ounces","name":"dried spaghetti"},{"value":"1","unit":"teaspoon","name":"freshly ground black pepper"},{"value":"1","unit":"large","name":"egg"},{"value":"1⁄3","unit":"cup","name":"panko (bread crumbs)"},{"value":"1","unit":"pound","name":"ground turkey, preferably dark meat"},{"value":"28","unit":"ounce can","name":"whole peeled tomatoes, plus their juices"},{"value":"1","unit":"tablespoon","name":"extra-virgin olive oil, or more as needed"}],"directions":["Bring a large pot of water to a boil over high heat. Add a generous pinch or two of salt.","Meanwhile, mince the parsley leaves and the garlic. Use a Microplane grater or box grater to grate the cheese.","Add the pasta to the boiling water; reduce the heat to medium-high and cook according to the package directions, until al dente.","While the pasta cooks, combine the parsley, garlic, egg, 1 teaspoon salt and the pepper, panko and ground turkey in a mixing bowl. Use your clean hands to gently mix, until thoroughly incorporated.","Form the meatballs; I like to do this in two steps, which won’t add extra time to the clock and eliminates the guesswork involved in making them all the right size: First, divide the meatball mixture into 16 equal portions, placing them on a piece of parchment paper or on a cutting board. Then, wet your hands and roll them into balls.","Drain the pasta, reserving 2 tablespoons of the pasta cooking water.","Heat the oil in a large nonstick skillet over medium heat. Add the meatballs and cook for 8 to 10 minutes, turning as needed to brown evenly. (They won’t be cooked through.)","Pour the tomatoes and their juices into a blender. Cover and puree until smooth, then transfer the sauce and the meatballs to the same pot you used for the spaghetti (which should at this point be cooked and drained, in the colander). Once the mixture starts to bubble, reduce the heat to medium-low, partially cover and cook for 10 to 12 minutes, which will finish cooking the meatballs.","Add the pasta to the pot, tossing gently to incorporate; add the pasta cooking water and let the whole thing cook for another minute or two; this will help thicken the sauce. Divide among bowls; drizzle with a little more oil, if desired, and scatter the Parm on each portion. Serve warm."]},{"recipename":"Giardiniera","id":75,"category":"General","source":"The Kitchn","image":"marconi.jpg","cc":"Joe Lingeman","wurl":"https://www.allrecipes.com/recipe/81581/hot-italian-giardiniera/","intro":"Visit any Italian market and, tucked among the\n                           olives, capers, and roasted red peppers, you’ll find giardiniera, jars\n                           of veggies swimming in vinegar and spices.\n                           If you have a few dry spices and vinegar in your pantry, you can DIY it, and the result is\n                           decidedly brighter and fresher than the jarred version.","notes":"If you're looking for a spicy, tangy, crunchy\n                           condiment to instantly jazz up just about anything you’re eating, giardiniera\n                           is it. i_pickle.png","used_in":[],"ingredient":[],"directions":[]},{"recipename":"Lemon Potatoes","id":80,"category":"Vegetables","source":"","image":"lemonpotatoes.jpg","cc":"","wurl":"https://www.youtube.com/watch?v=4drkNcIHmIs","intro":"","notes":"","used_in":[],"ingredient":[{"value":"","unit":"","name":"grated zest of and juice of 1 lemon"},{"value":"1/4","unit":"cup","name":"extra virgin olive oil (50 ml) "},{"value":"1/4","unit":"cup","name":"water"},{"value":"1","unit":"tsp","name":"dried oregano"},{"value":"6","unit":"medium","name":"baking or Yukon gold potatoes, peeled and cut in half"},{"value":"","unit":"","name":"freshly cracked black pepper "},{"value":"","unit":"","name":"fresh chopped parsley for garnish, optional"}],"directions":["Preheat oven to 375 degrees F. ","Whisk lemon juice, olive oil, water, and oregano in a small bowl to blend.\n                  Toss potatoes with lemon, oil mixture in a small roasting pan. You may add\n                  a little water at this stage.  Season with salt and\n                  pepper. Roast potatoes at 375 D until tender and golden brown, turning occasionally,\n                  about 35-45 minutes. Using metal spatula, loosen potatoes from roasting pan to\n                  prevent sticking.  If you prefer them soft, then cover the pan to steam and keep in\n                  moisture.  Remove from oven and let stand 5 minutes for them to absorb the rest of\n                  the olive oil in the pan. ","Sprinkle with freshly chopped parsley  if desired."]},{"recipename":"Lemon Chicken & Potatoes","id":81,"category":"Chicken","source":"","image":"lemon_oregano_roast_chicken.jpg","cc":"Lucy Parissi","wurl":"https://www.supergoldenbakes.com/one-pot-greek-ovenroasted-chicken-and/","intro":"","notes":"","used_in":[],"ingredient":[{"value":"1","unit":"large","name":" whole chicken without giblets preferably free-range (about 1.5kg /3.3lbs)"},{"value":"1/2","unit":"cup","name":"chicken stock or white wine"},{"value":"4","unit":"","name":"floury potatoes such as Maris piper, peeled and chopped into large cubes"},{"value":"1","unit":"small","name":"red onion peeled and halved"},{"value":"4","unit":"","name":"garlic cloves peeled and crushed"},{"value":"3-4","unit":"T","name":"virgin olive oil or more, as needed"},{"value":"2","unit":"tsp","name":"dried oregano or more, as needed"},{"value":"2","unit":"","name":"bay leaves"},{"value":"1","unit":"","name":"lemon"},{"value":"","unit":"","name":"freshly cracked black pepper "}],"directions":["Preheat the oven to 170C (325F).","Pat the chicken dry with kitchen towels (see above) and then rub all over with olive oil.\n                   Season generously with salt and pepper and place on a large roasting tin or casserole.","Squeeze half the lemon over the chicken and place it in the chicken cavity together with\n                  the onion and one bay leaf. Sprinkle with the dried oregano and pour a third of the stock\n                  into the pan. Cover with foil and roast for 40 minutes.","Take the pan out of the oven and arrange the potatoes, garlic and other bay around the\n                  chicken, drizzling with extra olive oil and seasoning with salt, pepper and more dried\n                  oregano. Squeeze the other lemon half over the potatoes, place in the pan, and add a\n                  bit more stock to the pan if it is dry. Cover with the foil and roast for another 40\n                  minutes.","Check the roast, turning the potatoes over. Add more stock if the pan is dry, cover\n                  and continue cooking for another 20-30 minutes or until the potatoes are fork tender\n                  and the chicken juices run clear. Increase the oven temperature to 220C (425F) and\n                  cook for a further 5-10 minutes or until the chicken skin crisps up.","Let the chicken rest, covered with foil, for 10 minutes before carving and serving\n                  with the potatoes and a Greek salad on the side."]},{"recipename":"Banana Bread","id":82,"category":"Baking","source":"Emma Christensen","image":"bananabread.png","cc":"www.thekitchn.com","intro":"","notes":"","used_in":[],"ingredient":[{"value":"8","unit":"tablespoons","name":" (1 stick or 113 grams) unsalted butter"},{"value":"1","unit":"cup","name":"sugar"},{"value":"2","unit":"","name":"eggs"},{"value":"1/4","unit":"cup","name":"milk"},{"value":"3","unit":"medium","name":"bananas, very ripe"},{"value":"2","unit":"cups ","name":"all-purpose flour"},{"value":"1","unit":"teaspoon","name":"baking soda"},{"value":"1/4","unit":"tsp","name":"salt"},{"value":"1/2","unit":"cup","name":" chopped nuts "}],"directions":["Heat the oven to 350°F and prep the pan. Arrange a rack in the bottom third of the oven and heat to 350°F.\n                  Line an 8x5-inch loaf pan with parchment paper, letting the excess hang over the long sides to form a sling.\n                  Spray the inside with cooking spray. → If using nuts, toast them in the oven for 10 minutes as the oven is\n                  pre-heating.","Melt the butter. Melt the butter in the microwave or over low heat on the stovetop. → Alternatively, for a\n                  more cake-like banana bread, soften the butter (but do not melt) and cream it with the sugar in a stand\n                  mixer in the next step.","Combine the butter and sugar. Place the melted butter and sugar in a large bowl and whisk until combined.\n                  (Or cream the softened butter and sugar in a mixer until fluffy.)","Add the eggs. Crack the eggs into the bowl. Whisk until completely combined and the mixture is smooth.","Add the milk and vanilla. Whisk the milk and vanilla into the batter.","Mash in the bananas. Peel the bananas and add them to the bowl. Using the end of the whisk or a dinner fork,\n                  mash them into the batter. Leave the bananas as chunky or as smooth as you prefer. If you prefer an entirely smooth\n                  banana bread, mash the bananas separately until no more lumps remain, and then whisk them into the batter.","Add the flour, baking soda, and salt. Measure the flour, baking soda, and salt into the bowl. Switch to using a\n                  spatula and gently stir until the ingredients are just barely combined and no more dry flour is visible.","Last but not least, scatter the nuts or chocolate over the batter and gently fold them in.","Bake for 50 to 65 minutes. Bake until the top of the cake is caramelized dark brown with some yellow interior\n                  peeking through and a toothpick or cake tester inserted into the middle comes out clean, 50 to 65 minutes. Baking\n                  time will vary slightly depending on the moisture and sugar content of your bananas — start checking around 50\n                  minutes and then every 5 minutes after."]},{"recipename":"Nectarine & Peach Jam","id":83,"category":"General","source":"NY Times","image":"nectarinejam.jpg","cc":"Andrew Scrivani for The New York Times","notes":"Making jam is simple. Canning isn’t. The canning part is why it took me years to make\n                a batch of jam, what with all that equipment and the measures you take to sterilize it.\n                What would happen if I did it wrong? Would I kill my whole family after one\n                marmalade-slathered breakfast?  Then I learned about refrigerator jam, which is just\n                what it sounds like: jam you store in the fridge instead of the pantry.\n\n                You don’t need to sterilize anything, you can skip the pectin and you can cook it\n                in batches of any size, from as small as a pint of perfect strawberries to as large\n                as a bushel of blueberries.","intro":"This is refrigerator jam, allowing you to skip the fuss and time of canning.\n                  Here, you’ll use a method from Christine Ferber, one of France’s eminent jam makers.\n                  She calls for macerating the fruit in sugar overnight so the juices release, then\n                  straining the liquid from the bowl and cooking that down to a syrup before re-adding\n                  the fruit. That allows you to cook the fruit less, retaining a better texture and\n                  fresher flavor. It works beautifully with this combination of peaches and nectarines\n                  spiked with lemon verbena.","used_in":[],"ingredient":[{"value":"3","unit":"pounds","name":"ripe nectarines or peaches, or a mix, pitted and sliced "},{"value":"730 ","unit":"grams","name":"  sugar (3 and 1/4 cups)"},{"value":"10","unit":"","name":"sprigs fresh lemon verbena "},{"value":"1","unit":"","name":"lemon"},{"value":"","unit":"","name":"Pinch salt "}],"directions":["Jam making at the most basic level, all you do is throw fruit and sugar into a pan,\n                  let it slowly bubble until it starts to look like jam, then taste. If it’s too sweet,\n                  add lemon juice. If it’s too tart, add more sugar (or honey, or maple syrup). You can\n                  add flavorings (spices, vanilla bean, booze, tea, herbs) if you want to zip things up.\n                  Or leave it plain, though I often add a pinch of salt to bring out the flavors.","Then let it cool, and store in the fridge (or freezer). Chances are you will eat it all\n                  before it starts to grow mold. And if you do spy a suspicious spot, rest assured that the\n                  molds that generally grow on jam are not the deadly kind. Some of my friends just scrape\n                  off any suspect bits and eat the jam anyway.","Ever since I learned the joys of refrigerator jam, I’ve made it often. Over the years,\n                  I’ve refined certain aspects. If I have time, I use a method I picked up from\n                  Christine Ferber, one of France’s eminent jam makers. She calls for macerating the fruit\n                  in sugar overnight so the juices release, then straining the liquid from the bowl, cooking\n                  that down to a syrup before re-adding the fruit. This allows you to cook the fruit less,\n                  retaining a better texture and fresher flavor.","LET'S get started! Grate zest from half the lemon and place zest in a large saucepan. Juice lemon and add\n                  the juice to the zest. Toss in fruit, sugar, salt and lemon verbena and bring to a simmer.\n                  Turn mixture into a large bowl and refrigerate overnight.","Strain the liquid from the mixture into a wide, shallow pot or large skillet, reserving\n                  the fruit. Bring liquid to a simmer and cook until it thickens enough to wrinkle on the\n                  surface when you push it with a spoon (a candy thermometer should read 220 degrees).","Remove lemon verbena from fruit and add fruit to the pot with the syrup. Simmer fruit\n                  gently until mixture looks very thick and jamlike. You can test the jam to see if it’s\n                  ready by freezing a small plate. Drop a bit of the jam on the plate, let it cool for a\n                  minute and then push it with your finger. The top should wrinkle. If syrup is thin and\n                  runny, keep cooking and test again in a few minutes (return plate to freezer in the\n                  meantime).","Let jam cool, then store in refrigerator or freezer."]},{"recipename":"Grilled Cobb Salad","id":87,"category":"Salads","source":"Adam Rapoport","image":"adam-cobb.png","cc":"Christopher Testani","wurl":"https://www.bonappetit.com/columns/letter-from-the-editor-columns/article/adam-rapoport-barbecue","intro":"The editor of Bon Appetit threw a barbeque dinner.  The star of the night, at a\n                  table packed with big eaters, wasn’t the red meat. What everyone wanted seconds and\n                  thirds of was a grain salad, loaded with a medley of grilled cherry tomatoes\n                  (one of many reasons you need a grill topper), charred scallions (a go-to for\n                  any grilled meal), buttery cubes of avocado, chopped toasted pistachios, and\n                  lots of fresh mint (you can never have too much mint). It was like a grilled Cobb\n                  salad, but for the modern, slightly healthy-ish set.","notes":"For a simple summer salad, grill vegetables of your choice and serve\n                  with a hearty grain, such as quinoa or farro.\n                  This version, created by editor-in-chief Adam Rapoport, goes great with a shallot vinaigrette\n                  created by his wife","used_in":[],"ingredient":[{"value":"1","unit":"bunch ","name":"scallions"},{"value":"1","unit":"pint ","name":"cherry tomatoes"},{"value":"1","unit":"","name":"avocado, cut into 1-inch pieces"},{"value":"","unit":"","name":"Flaky sea salt"},{"value":"1½ ","unit":"cup","name":"quinoa"},{"value":"¼","unit":"cup","name":"olive oil, plus more"},{"value":"½","unit":"cup","name":"mint leaves"},{"value":"3","unit":"T","name":"fresh lemon juice"},{"value":"¼","unit":"cup","name":"chopped toasted pistachios"}],"directions":["Bring quinoa, 1 tsp. kosher salt, and 3 cups water to a boil in a medium saucepan. Cover, reduce heat to low, and simmer until quinoa is tender, 8–10 minutes. Remove pan from heat and let sit 15 minutes. Fluff quinoa with a fork; transfer to a large bowl.","Whisk lemon juice and ¼ cup oil in a small bowl. Drizzle over warm quinoa and toss to coat; season with salt and pepper. Let cool.","Prepare a grill for medium-high heat. Grill scallions and tomatoes in a grill basket, turning occasionally, until charred in spots and tomatoes begin to split, 6–8 minutes. Transfer to a cutting board and slice scallions into 1\" pieces.","Spoon quinoa onto a platter and top with scallions, tomatoes, avocado, mint, and pistachios. Drizzle with oil and sprinkle with sea salt."]},{"recipename":"Shallot Vinaigrette","id":88,"category":"Sauces","source":"Bon Appetit","image":"","cc":"","wurl":"","intro":"Vinaigrette can be made 1 week ahead and kept refrigerated. Bring to\n                  room temperature and shake before using.","notes":"","used_in":[],"ingredient":[{"value":"1","unit":"","name":"shallot, finely chopped"},{"value":"2","unit":"tablespoons","name":"fresh lemon juice"},{"value":"1","unit":"T","name":"unseasoned rice vinega"},{"value":"1/3","unit":"cup","name":"olive oil"},{"value":"","unit":"","name":"pepper & salt"}],"directions":["Combine 1 finely chopped shallot, 2 tablespoons fresh lemon juice, and\n                   1 tablespoon unseasoned rice vinegar in a jar; season with kosher salt and\n                   freshly ground black pepper. Let sit 20 minutes. Add 1/3 cup olive oil and cover.\n                   Shake to combine."]},{"recipename":"Plum Almond Cake","id":94,"category":"Baking","source":"Vintage Kitchen","image":"plummy.jpg","cc":"","wurl":"https://vintagekitchennotes.com/almond-plum-cake/","intro":"","notes":"The best and easiest way to pit plums is with an apple corer.","used_in":[],"ingredient":[{"value":"1","unit":"","name":"egg, room temperature"},{"value":"4","unit":"","name":"red plums (stoned and each half in fourths)"},{"value":"","unit":"","name":"Powdered sugar (to serve)"},{"value":"2/3","unit":"cup","name":"fine muscovado or dark brown sugar (135g)"},{"value":"1","unit":"cup","name":"ground almonds, or almond meal (95g)"},{"value":"3/4","unit":"cup","name":"superfine whole wheat flour (70g)"},{"value":"6","unit":"T","name":"butter"},{"value":"2","unit":"T","name":"runny honey"},{"value":"1","unit":"tsp","name":"pure almond extract and vanilla extract, each"},{"value":"1/2 ","unit":"tsp","name":"baking powder"},{"value":"1/4 ","unit":"tsp","name":"salt"}],"directions":["Preheat oven to 350ºF / 180ºC. Line or butter an 8-inch round with removable\n                    bottom or square cake pan lined with parchment paper.","Melt butter in a large bowl. Add sugar and honey. Mix well with a hand beater.","Add egg, extracts salt and baking powder. Mix well until creamy.\n                    Add flours in 2 or 3 parts, mixing well, but not too much.\n                    Pour into the prepared pan and arrange plum pieces on top.","Bake for about 30-40 minutes, until a tester comes almost dry (this is a very moist cake so it will not be completely dry).\n                    Let cool completely on wire rack.\n                    Sprinkle powdered sugar on top (not too much) and serve."]},{"recipename":"Mac with Cream Cheese","id":95,"category":"Pasta","source":"The Dish on Oz","image":"macncheese.jpg","cc":"","wurl":"","intro":"","notes":"","used_in":[],"ingredient":[{"value":"1","unit":"lb ","name":"cooked macaroni"},{"value":"2","unit":"T","name":"Butter for the Roux"},{"value":"2","unit":"T","name":"Flour"},{"value":"4","unit":"cup","name":"Milk"},{"value":"1/2","unit":"stick","name":"Cream Cheese, (My guess: 4 oz or 113 g)"},{"value":"4-5","unit":"cups","name":"Shredded cheddar"},{"value":"2","unit":"T","name":"Butter for the Topping"},{"value":"1","unit":"cup","name":"Toasted panko breadcrumbs"},{"value":"1/2","unit":"tsp","name":"garlic, minced"},{"value":"1","unit":"tsp","name":"chopped parsely"}],"directions":["Heat a large Dutch oven medium heat and add 2 tablespoons\n                  butter. Stir in the flour and cook until light brown and bubbling, about 4 minutes.\n                  Add the milk and bring just to a simmer and then reduce to medium-low heat. Stir in\n                  the cream cheese and the cheddar. Season with salt and pepper.","Add in the macaroni.  Melt the remaining 2 tablespoons butter in a skillet and stir\n                  in the garlic. Place the breadcrumbs into a small bowl and add the garlic butter\n                  and the parsley and sprinkle over the mac n' cheese."]},{"recipename":"Lobster Mac and Cheese","id":96,"category":"Pasta","source":"Brook Crist","image":"brookmac.png","cc":"","wurl":"","intro":"","notes":"","used_in":[],"ingredient":[],"directions":["Start a pot of boiling water, as well as set your oven to 375.","Boil your lobsters till they turn orange.\n                    Once they’re cool enough to touch, take a knife and cut them open from the bottom side.\n                    Rinse out any sand/dirt that may of been left from cleaning.\n                    Lobster should pull right out of the shell. (Optional: remove some of the skin if it feels\n                    thick/rubbery). Cut the lobster into bite size pieces. ","You can cook your family size box of your favorite pasta in the same water you boiled your\n                    lobsters in for a stronger seafood taste, Or start a fresh pot of water.","Place 2 cups of half and half (or heavy cream or even regular milk) in a separate pot on low\n                    to warm up.","In a separate pot melt 4 tablespoons of butter. once melted, SLOWLY mix in 1/4 cup of\n                    flour. this mixture will become thick, once it turns golden brown and you won’t be able\n                    to smell the scent of raw flour, add the warm milk in slowly. ","Here's the fun part! Once thats mixed throughly, add the cheese! I used only cheddar because\n                    thats all I had in the fridge. Feel free to use gruyere, romano, or a mix of them all. Slowly mix\n                    in the cheese.","Add drained pasta shells to cheese sauce, add lobster to pasta.\n                    Pour into baking dish. ","For topping: mix together 3/4 cup of italian bread crumbs with 2 tablespoons of melted\n                    butter. spread this over the mac and cheese and finish it off with some sprinkled\n                    paprika over the top.","Place in oven till you notice the top becomes browned and the cheese should start to boil.\n                    About 15-20 minutes.","Disclaimer: I wish I had made my cheese sauce less thick so the mac and cheese wouldn't of\n                    been as thick. Next time I will add a little more cream and a little less cheese to\n                    have a less thick consistency making it slightly less dry. BUT if you liked the way mine\n                    looked then don’t change it!","A viewer Comment:  If you want the cheese sauce to be less thick, make less roux and then\n                    you won’t lose the cheesiness or end up using too much half and half"]},{"recipename":"Scalloped Potatoes","id":97,"category":"Vegetables","source":"allrecipes.com","image":"scalloped.png","cc":"Allrecipes","wurl":"","intro":"The key is to heat the milk first! ","notes":"","used_in":[],"ingredient":[{"value":"3","unit":"cups","name":"whole milk, or as needed "},{"value":"9","unit":"T","name":"all-purpose flour, divided"},{"value":"6","unit":"T","name":"butter, diced and divided"},{"value":"1/2","unit":"","name":"onion, thinly sliced"},{"value":"3","unit":"pounds","name":" potatoes, thinly sliced"},{"value":"","unit":"","name":"pinch salt and ground black pepper to taste"}],"directions":["Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.","Spread about 1/3 of the potato slices into the bottom of the prepared baking dish.\n                    Top with about 1/3 of the onion slices. Sprinkle 3 tablespoons flour over the potato\n                    and onion. Arrange 2 tablespoons butter atop the flour. Season the entire layer with\n                    salt and pepper. Repeat layering twice more.","Heat milk in a saucepan until warm. Pour enough warm milk over the mixture in the\n                    baking dish so the top of the liquid is level with the final layer of potatoes.","Bake in preheated oven until potatoes are tender, 45 to 60 minutes."]}]